[
    {
        "recipe_id": 1,
        "recipe_name": "Spaghetti Carbonara",
        "short_description": "Classic Italian pasta dish with bacon, eggs, and cheese.",
        "recipe_image": "spaghetti_carbonara.jpg",
        "ingredients": ["200g spaghetti", "100g pancetta or bacon", "2 large eggs", "50g grated Parmesan cheese"],
        "instructions": "Cook spaghetti according to package instructions. In a separate pan, fry pancetta or bacon until crispy. Beat eggs and mix with grated Parmesan cheese. Drain spaghetti and combine with bacon. Pour egg mixture over spaghetti and stir quickly until eggs are cooked. Serve immediately.",
        "preparing_time": 30,
        "calories": 500
    },
    {
        "recipe_id": 2,
        "recipe_name": "Chicken Stir-Fry",
        "short_description": "Healthy and flavorful chicken stir-fry with vegetables.",
        "recipe_image": "chicken_stir_fry.jpg",
        "ingredients": ["300g chicken breast", "1 bell pepper", "1 onion", "2 cloves garlic"],
        "instructions": "Heat oil in a pan. Add minced garlic and sliced chicken breast. Cook until chicken is browned. Add sliced bell pepper and onion. Stir-fry until vegetables are tender. Season with soy sauce and serve hot.",
        "preparing_time": 25,
        "calories": 400
    },
    {
        "recipe_id": 3,
        "recipe_name": "Vegetable Soup",
        "short_description": "Hearty and nutritious soup with assorted vegetables.",
        "recipe_image": "vegetable_soup.jpg",
        "ingredients": ["2 carrots", "2 celery stalks", "1 onion", "1 potato"],
        "instructions": "In a large pot, sauté chopped onions until translucent. Add diced carrots, celery, and potato. Pour in vegetable broth and bring to a boil. Simmer until vegetables are tender. Season with salt and pepper to taste. Serve hot.",
        "preparing_time": 40,
        "calories": 150
    },
    {
        "recipe_id": 4,
        "recipe_name": "Chocolate Chip Cookies",
        "short_description": "Classic homemade cookies with chocolate chips.",
        "recipe_image": "chocolate_chip_cookies.jpg",
        "ingredients": ["200g all-purpose flour", "100g butter", "100g white sugar", "100g brown sugar", "1 egg", "1 tsp vanilla extract", "100g chocolate chips"],
        "instructions": "Preheat oven to 350°F (175°C). In a bowl, cream together softened butter, white sugar, and brown sugar until smooth. Beat in the egg and vanilla extract. Gradually blend in the flour. Stir in the chocolate chips. Drop dough by rounded spoonfuls onto ungreased cookie sheets. Bake for 10 to 12 minutes until edges are golden brown. Let cookies cool on baking sheet for 5 minutes before transferring to wire racks to cool completely.",
        "preparing_time": 20,
        "calories": 150
    },
    {
        "recipe_id": 5,
        "recipe_name": "Caesar Salad",
        "short_description": "Classic Caesar salad with crisp romaine lettuce and homemade dressing.",
        "recipe_image": "caesar_salad.jpg",
        "ingredients": ["1 head romaine lettuce", "1/2 cup Caesar dressing", "1/4 cup grated Parmesan cheese", "1 cup croutons"],
        "instructions": "In a large bowl, toss together torn romaine lettuce, Caesar dressing, and grated Parmesan cheese until evenly coated. Top with croutons and serve immediately.",
        "preparing_time": 15,
        "calories": 250
    },
    {
        "recipe_id": 6,
        "recipe_name": "Mushroom Risotto",
        "short_description": "Creamy and flavorful Italian rice dish with mushrooms.",
        "recipe_image": "mushroom_risotto.jpg",
        "ingredients": ["1 cup Arborio rice", "200g mushrooms", "1 onion", "2 cloves garlic", "4 cups vegetable broth", "1/2 cup dry white wine", "1/4 cup grated Parmesan cheese"],
        "instructions": "In a saucepan, heat vegetable broth and keep it simmering. In a separate pan, sauté chopped onions and minced garlic until translucent. Add Arborio rice and cook, stirring constantly, until rice is translucent around the edges. Pour in white wine and cook until absorbed. Add sliced mushrooms and a ladleful of hot broth. Cook, stirring frequently, until broth is absorbed. Continue adding broth, one ladleful at a time, and cook until rice is creamy and tender. Stir in grated Parmesan cheese and serve hot.",
        "preparing_time": 35,
        "calories": 300
    },
    {
        "recipe_id": 7,
        "recipe_name": "Greek Salad",
        "short_description": "Healthy and refreshing salad with cucumbers, tomatoes, and feta cheese.",
        "recipe_image": "greek_salad.jpg",
        "ingredients": ["2 cucumbers", "4 tomatoes", "1 red onion", "200g feta cheese", "1/4 cup olive oil", "2 tbsp red wine vinegar", "1 tsp dried oregano"],
        "instructions": "Chop cucumbers, tomatoes, and red onion into bite-sized pieces. Crumble feta cheese over the top. In a small bowl, whisk together olive oil, red wine vinegar, and dried oregano. Drizzle dressing over salad and toss to combine. Serve chilled.",
        "preparing_time": 15,
        "calories": 200
    },
    {
        "recipe_id": 8,
        "recipe_name": "Beef Stir-Fry",
        "short_description": "Tender beef strips stir-fried with vegetables in a savory sauce.",
        "recipe_image": "beef_stir_fry.jpg",
        "ingredients": ["400g beef sirloin steak", "1 red bell pepper", "1 green bell pepper", "1 yellow bell pepper", "1 onion", "2 cloves garlic"],
        "instructions": "Slice beef into thin strips. Heat oil in a pan or wok over high heat. Add minced garlic and sliced beef. Stir-fry until beef is browned. Add sliced bell peppers and onion. Stir-fry until vegetables are tender-crisp. Season with soy sauce and serve hot with rice or noodles.",
        "preparing_time": 30,
        "calories": 450
    }
]